NextFOAM-2407/tutorials/incompressible/pimpleFoam/laminar/contactAngleCavity/system/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches ( top );

boundary
{
    left
    {
        type patch;
        neighbourPolyPatch  left;
    }

    right
    {
        type patch;
        neighbourPolyPatch  right;
    }

    frontAndBack
    {
        type empty;
        neighbourPolyPatch  frontAndBack;
    }
}


// ************************************************************************** //
